app/views/paintings/show.html.erb

SELECT "paintings".* FROM "paintings" WHERE ("paintings"."id" = 2) LIMIT 1
---

<% @painting = Painting.find(params[:id]) %>