app/controllers/songs_controller.rb

  def show
    @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 3) LIMIT 1

  def download
    @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 11) LIMIT 1

  def create
    coords = params[:coords]
    tempo = params[:tempo] ? params[:tempo] : '48'
    genre = params[:genre] ? params[:genre] : 'CountryPop'
    key = params[:key] ? params[:key] : 'A'
    chordProgression = params[:chordProgression] ? params[:chordProgression] : 'cp1'
    numPhrase = params[:numPhrase] ? params[:numPhrase] : '8'
    avatar = params[:avatar] ? params[:avatar] : File.open("./public/images/#{genre}-Icon.png")
    vocal = params[:vocal] ? params[:vocal] : File.open("./public/system/test.wav")
#    avatar = params[:avatar] ? params[:avatar] : File.open('./public/images/CountryPop-Icon.png')

    @song = Song.create(:name => params[:name],:coords => coords, :genre => genre,
                        :tempo => tempo, :key => key, :chordProgression => chordProgression,
                        :numPhrase => numPhrase, :avatar => avatar, :vocal => vocal)
    if @song.save
---
INSERT INTO "songs" ("numPhrase", "midi_updated_at", "autotuned_content_type", "updated_at", "midi_content_type", "melody_file_name", "tempo", "genre", "vocal_file_size", "avatar_content_type", "autotuned_file_size", "avatar_file_name", "midi_file_name", "name", "midi_file_size", "coords", "autotuned_updated_at", "vocal_updated_at", "avatar_file_size", "chordProgression", "vocal_file_name", "autotuned_file_name", "vocal_content_type", "melody_file_size", "style", "key", "avatar_updated_at", "melody_updated_at", "melody_content_type", "created_at") VALUES ('8', NULL, NULL, '2011-02-24 05:26:14.112154', NULL, NULL, '48', 'CountryPop', 1540140, 'image/png', NULL, 'CountryPop-Icon.png', NULL, 'WITH MORE NOTES', NULL, '137,256,317,326,301,243,168,351,360,355', NULL, '2011-02-24 05:26:13.800123', 15504, 'VI_m-IV-I-V', 'test.wav', NULL, 'application/x-wav', NULL, NULL, 'Eb', '2011-02-24 05:26:14.063149', NULL, NULL, '2011-02-24 05:26:14.112154')
UPDATE "songs" SET "autotuned_file_name" = 'autotuned.wav', "melody_file_name" = 'melody.mid', "midi_file_name" = 'generated.mid', "updated_at" = '2011-02-24 04:27:20.658830', "vocal_file_name" = 'public/system/test.wav' WHERE ("songs"."id" = 7)

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT "songs".* FROM "songs" WHERE ("songs"."id" = 3) LIMIT 1
DELETE FROM "songs" WHERE ("songs"."id" = 3)